Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM1216JH01048.svd
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x18</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>OVR0</name>
                     <description>Channel 0 Overrun</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR1</name>
                     <description>Channel 1 Overrun</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR2</name>
                     <description>Channel 2 Overrun</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR3</name>
                     <description>Channel 3 Overrun</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR4</name>
                     <description>Channel 4 Overrun</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR5</name>
                     <description>Channel 5 Overrun</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR6</name>
                     <description>Channel 6 Overrun</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR7</name>
                     <description>Channel 7 Overrun</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR8</name>
                     <description>Channel 8 Overrun</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR9</name>
                     <description>Channel 9 Overrun</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR10</name>
                     <description>Channel 10 Overrun</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVR11</name>
                     <description>Channel 11 Overrun</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD0</name>
                     <description>Channel 0 Event Detection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD1</name>
                     <description>Channel 1 Event Detection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD2</name>
                     <description>Channel 2 Event Detection</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD3</name>
                     <description>Channel 3 Event Detection</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD4</name>
                     <description>Channel 4 Event Detection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD5</name>
                     <description>Channel 5 Event Detection</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD6</name>
                     <description>Channel 6 Event Detection</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD7</name>
                     <description>Channel 7 Event Detection</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD8</name>
                     <description>Channel 8 Event Detection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD9</name>
                     <description>Channel 9 Event Detection</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD10</name>
                     <description>Channel 10 Event Detection</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVD11</name>
                     <description>Channel 11 Event Detection</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWEVT</name>
               <description>Software Event</description>
               <addressOffset>0x1C</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CHANNEL0</name>
                     <description>Channel 0 Software Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL1</name>
                     <description>Channel 1 Software Selection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL2</name>
                     <description>Channel 2 Software Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL3</name>
                     <description>Channel 3 Software Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL4</name>
                     <description>Channel 4 Software Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL5</name>
                     <description>Channel 5 Software Selection</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL6</name>
                     <description>Channel 6 Software Selection</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL7</name>
                     <description>Channel 7 Software Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL8</name>
                     <description>Channel 8 Software Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL9</name>
                     <description>Channel 9 Software Selection</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL10</name>
                     <description>Channel 10 Software Selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHANNEL11</name>
                     <description>Channel 11 Software Selection</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>12</dim>
               <dimIncrement>4</dimIncrement>
               <name>CHANNEL[%s]</name>
               <description>Channel n</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>EVGEN</name>
                     <description>Event Generator Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PATH</name>
                     <description>Path Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PATHSelect</name>
                        <enumeratedValue>
                           <name>SYNCHRONOUS</name>
                           <description>Synchronous path</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESYNCHRONIZED</name>
                           <description>Resynchronized path</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNCHRONOUS</name>
                           <description>Asynchronous path</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDGSEL</name>
                     <description>Edge Detection Selection</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>EDGSELSelect</name>
                        <enumeratedValue>
                           <name>NO_EVT_OUTPUT</name>
                           <description>No event output when using the resynchronized or synchronous path</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_EDGE</name>
                           <description>Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING_EDGE</name>
                           <description>Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH_EDGES</name>
                           <description>Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in standby</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>Generic Clock On Demand</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>45</dim>
               <dimIncrement>4</dimIncrement>
               <name>USER[%s]</name>
               <description>User Multiplexer n</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>CHANNEL</name>
                     <description>Channel Event Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
