Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM1216JH01048.svd
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x14</addressOffset>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>NVM Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>READYSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>The NVM controller is busy programming or erasing.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>The NVM controller is ready to accept a new command</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ERROR</name>
                     <description>Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ERRORSelect</name>
                        <enumeratedValue>
                           <name>Val_0</name>
                           <description>No errors have been received since the last clear</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Val_1</name>
                           <description>At least one error has occurred since the last clear</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLASHERR</name>
                     <description>FLASH Err</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>Fault Capture Interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x18</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>PRM</name>
                     <description>Power Reduction Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOAD</name>
                     <description>NVM Page Buffer Active Loading</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PROGE</name>
                     <description>Programming Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKE</name>
                     <description>Lock Error Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NVME</name>
                     <description>NVM Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SB</name>
                     <description>Security Bit Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>NVM Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>22</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LOCK</name>
               <description>Lock Section</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>Region Lock Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PBLDATA0</name>
               <description>Page Buffer Load Data 0</description>
               <addressOffset>0x28</addressOffset>
               <access>read-only</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PBLDATA</name>
                     <description>Page Buffer Load Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PBLDATA1</name>
               <description>Page Buffer Load Data 1</description>
               <addressOffset>0x2C</addressOffset>
               <access>read-only</access>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>PBLDATA</name>
                     <description>Page Buffer Load Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
