Ac6Embedded/svd-microchip/PIC32CM_JH/PIC32CM1216JH01048.svd
            <register>
               <name>STATUSC</name>
               <description>Peripheral write protection status - Bridge C</description>
               <addressOffset>0x3C</addressOffset>
               <access>read-only</access>
               <resetValue>0x09000000</resetValue>
               <fields>
                  <field>
                     <name>EVSYS_</name>
                     <description>EVSYS APB Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM0_</name>
                     <description>SERCOM0 APB Protect Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM1_</name>
                     <description>SERCOM1 APB Protect Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM2_</name>
                     <description>SERCOM2 APB Protect Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM3_</name>
                     <description>SERCOM3 APB Protect Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN0_</name>
                     <description>CAN0 APB Protect Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC0_</name>
                     <description>TC0 APB Protect Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1_</name>
                     <description>TC1 APB Protect Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2_</name>
                     <description>TC2 APB Protect Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC3_</name>
                     <description>TC3 APB Protect Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC4_</name>
                     <description>TC4 APB Protect Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC0_</name>
                     <description>ADC0 APB Protect Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AC_</name>
                     <description>AC APB Protect Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SMBIST_</name>
                     <description>SMBIST APB Protect Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>PM</name>
         <version>U22402.1.1</version>
         <description>Power Manager</description>
         <baseAddress>0x40000400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xA</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SYSTEM</name>
            <description>System peripherals shared interrupt</description>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>SLEEPCFG</name>
               <description>Sleep Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>SLEEPMODE</name>
                     <description>Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SLEEPMODESelect</name>
                        <enumeratedValue>
                           <name>IDLE0</name>
                           <description>CPU clock is OFF. AHB/APB clocks are provided to CAN and to IPs requesting them</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE2</name>
                           <description>CPU clock is OFF. AHB/APB clocks are provided to IPs requesting them (CAN excluded)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STANDBY</name>
                           <description>CPU clock is OFF. AHB/APB clocks are stopped except if requested</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STDBYCFG</name>
               <description>Standby Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <resetValue>0x0400</resetValue>
               <fields>
                  <field>
                     <name>VREGSMOD</name>
                     <description>Voltage Regulator Standby mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>VREGSMODSelect</name>
                        <enumeratedValue>
                           <name>AUTO</name>
                           <description>Automatic mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERFORMANCE</name>
                           <description>Performance oriented</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LP</name>
                           <description>Low Power oriented</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BBIASHS</name>
                     <description>Back Bias for SRAM</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
